import React from 'react';
import "../css/privacypolicy.css"

const PrivacyPolicyPage = () => {
    return (
        <div className="privacy-policy">
            <h1>Политика конфиденциальности игры &quot;Марсик-детектив&quot;</h1>
            <p>
                Настоящая Политика конфиденциальности (далее — Политика) описывает, как компания &quot;ИП Лысиков В.А.&quot; (далее —
                Компания) собирает, использует, хранит и защищает информацию, которую пользователи предоставляют при использовании игры
                &quot;Марсик-детектив&quot; (далее — Игра).
            </p>

            <h2>1. Общие положения</h2>
            <ol>
                <li>
                    Настоящая Политика является неотъемлемой частью Пользовательского соглашения и регулирует порядок обработки персональных
                    данных пользователей.
                </li>
                <li>
                    Пользователь соглашается с условиями настоящей Политики при регистрации в Игре или при первом использовании Игры.
                </li>
            </ol>

            <h2>2. Сбор информации</h2>
            <ol>
                <li>
                    Компания собирает следующую информацию:

                    • Данные, которые пользователь предоставляет добровольно (например, имя, возраст, пол, адрес электронной почты).

                    • Данные, которые автоматически собираются при использовании Игры (например, IP-адрес, тип устройства, версия
                    операционной системы, время и дата использования).
                </li>
                <li>
                    Компания может использовать cookies и другие технологии для сбора информации о взаимодействии пользователя с Игрой.
                </li>
            </ol>

            <h2>3. Использование информации</h2>
            <ol>
                <li>
                    Компания использует собранную информацию для:

                    • Улучшения качества Игры и предоставления персонализированного контента.

                    • Обеспечения безопасности и предотвращения мошенничества.

                    • Отправки уведомлений и обновлений.
                </li>
                <li>
                    Компания не передает персональные данные третьим лицам без согласия пользователя, за исключением случаев,
                    предусмотренных законодательством.
                </li>
            </ol>

            <h2>4. Хранение и защита информации</h2>
            <ol>
                <li>
                    Компания принимает меры для защиты персональных данных от несанкционированного доступа, изменения, раскрытия или
                    уничтожения.
                </li>
                <li>
                    Компания хранит персональные данные в течение времени, необходимого для достижения целей, указанных в настоящей
                    Политике.
                </li>
            </ol>

            <h2>5. Права пользователя</h2>
            <ol>
                <li>
                    Пользователь имеет право:

                    • Запрашивать информацию о своих персональных данных.

                    • Требовать исправления или удаления своих персональных данных.

                    • Отказаться от получения уведомлений и маркетинговых сообщений.
                </li>
                <li>
                    Для реализации своих прав пользователь может обратиться в службу поддержки Компании.
                </li>
            </ol>

            <h2>6. Изменения Политики</h2>
            <ol>
                <li>
                    Компания оставляет за собой право вносить изменения в настоящую Политику. Обновленная версия Политики будет
                    опубликована на сайте Игры.
                </li>
                <li>
                    Пользователь обязуется регулярно проверять актуальную версию Политики.
                </li>
            </ol>

            <h2>7. Контактная информация</h2>
            <ol>
                <li>
                    Для получения дополнительной информации или для связи с Компанией по вопросам, связанным с настоящей Политикой,
                    пользователь может обратиться по адресу электронной почты: zeromannull@gmail.com.
                </li>
            </ol>

            <p>Настоящая Политика вступает в силу с момента ее публикации.</p>
        </div>
    );
};

export default PrivacyPolicyPage;
